In [13]:
import pandas as pd
import numpy as np
import sklearn

In [3]:
import seaborn as sns
df = sns.load_dataset('titanic')

In [4]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [10]:
df2 = df.copy()
df2.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [14]:
df2['age'] = df2['age'].fillna(np.mean(df2['age']))

In [22]:
df2.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [18]:
df2['embarked'].fillna(df2['embarked'].mode()[0], inplace=True)

In [19]:
df2['deck'].fillna(df2['deck'].mode()[0], inplace=True)

In [21]:
df2['embark_town'].fillna(df2['embark_town'].mode()[0], inplace=True)

In [23]:
df2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,C,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,C,Southampton,no,True

In [30]:
deduped = df.drop_duplicates()

In [32]:
sexes = deduped['sex'].value_counts()
print(sexes)

sex
male      491
female    293
Name: count, dtype: int64

In [33]:
ages = deduped['age'].value_counts()
print(ages)

age
24.00    29
18.00    25
22.00    24
19.00    23
28.00    22
         ..
36.50     1
0.92      1
23.50     1
55.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [34]:
deduped[age < 1 || age >70]

SyntaxError: invalid syntax (3073512583.py, line 1)